In [22]:
import pandas as pd

In [23]:
avg_df = pd.read_csv("./us_avg.csv")
min_df = pd.read_csv("./us_min.csv")
max_df = pd.read_csv("./us_max.csv")

In [24]:
avg_df = avg_df.drop(columns=["Anomaly"])
min_df = min_df.drop(columns=["Anomaly"])
max_df = max_df.drop(columns=["Anomaly"])

In [25]:
avg_df.columns = avg_df.columns.str.lower()
min_df.columns = min_df.columns.str.lower()
max_df.columns = max_df.columns.str.lower()

In [26]:
avg_df["month"] = avg_df["date"] % 100  # 190001 -> 01
avg_df["year"] = avg_df["date"] // 100  # 190001 -> 1900

min_df["month"] = min_df["date"] % 100
min_df["year"] = min_df["date"] // 100

max_df["month"] = max_df["date"] % 100
max_df["year"] = max_df["date"] // 100

avg_df = avg_df.drop(columns=["date"])
min_df = min_df.drop(columns=["date"])
max_df = max_df.drop(columns=["date"])

In [27]:
avg_df = avg_df[['year', 'month', 'value']]  # reorder columns
min_df = min_df[['year', 'month', 'value']]
max_df = max_df[['year', 'month', 'value']]

In [28]:
avg_df

      year  month  value
0     1900      1  34.11
1     1900      2  30.76
2     1900      3  41.27
3     1900      4  51.60
4     1900      5  61.72
...    ...    ...    ...
1494  2024      7  75.69
1495  2024      8  73.99
1496  2024      9  68.61
1497  2024     10  58.98
1498  2024     11  45.28

[1499 rows x 3 columns]

In [29]:
min_df

      year  month  value
0     1900      1  23.94
1     1900      2  19.36
2     1900      3  29.53
3     1900      4  39.85
4     1900      5  48.56
...    ...    ...    ...
1494  2024      7  62.96
1495  2024      8  61.27
1496  2024      9  55.36
1497  2024     10  44.82
1498  2024     11  34.88

[1499 rows x 3 columns]

In [30]:
max_df

      year  month  value
0     1900      1  44.26
1     1900      2  42.13
2     1900      3  52.99
3     1900      4  63.34
4     1900      5  74.88
...    ...    ...    ...
1494  2024      7  88.39
1495  2024      8  86.70
1496  2024      9  81.84
1497  2024     10  73.13
1498  2024     11  55.67

[1499 rows x 3 columns]

In [31]:
avg_df.to_csv("us_avg_clean.csv", index=False)
min_df.to_csv("us_min_clean.csv", index=False)
max_df.to_csv("us_max_clean.csv", index=False)